# --- Этап 1: Сборка (Builder) ---
# Используем полный образ Go для компиляции приложения
FROM golang:1.24.4-alpine AS builder

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем файлы зависимостей
COPY go.mod go.sum ./
# Загружаем зависимости
RUN go mod download

# Копируем весь исходный код
COPY . .

# Собираем приложение в статически слинкованный бинарник
# CGO_ENABLED=0 - отключает CGO, что важно для Alpine.
# -ldflags="-w -s" - уменьшает размер бинарника, удаляя отладочную информацию.
RUN CGO_ENABLED=0 go build -ldflags="-w -s" -o /app/srmt-admin ./cmd/main.go


# --- Этап 2: Финальный образ (Final) ---
# Используем минимальный базовый образ, который не содержит ничего лишнего
FROM alpine:latest

# Устанавливаем timezone data для поддержки временных зон
RUN apk add --no-cache tzdata

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем ТОЛЬКО скомпилированный бинарник из этапа сборки
COPY --from=builder /app/srmt-admin .

# Копируем ТОЛЬКО директорию с конфигурациями
COPY config ./config

# Копируем директорию с миграциями
COPY migrations ./migrations

# Указываем порт
EXPOSE 9010

# Устанавливаем переменную окружения для пути к файлу конфигурации
# Используем абсолютный путь внутри контейнера для надежности
ENV CONFIG_PATH=/app/config/prod.yaml

# Команда для запуска приложения
CMD ["./srmt-admin"]